#+TITLE: Emacs configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+STARTUP: overview

The best place to read this file is at https://quarkQuark.github.io/literate-config/emacs. The org-mode source is stored at https://github.com/quarkQuark/dotfiles/tree/master/.config/emacs.

*** Capture templates

#+begin_src emacs-lisp
  (use-package org-cliplink)
  (add-hook 'org-capture-mode-hook 'evil-insert-state)

  (setq quark/properties-date-string
        ":PROPERTIES:\n:CAPTURED: %U\n:END:")

  (setq quark/org-capture-bookmark
        `("b" "Bookmark"
          entry (file+olp "" "Bookmarks" "Inbox")
          ,(concat "** %(org-cliplink-capture)%?\n" quark/properties-date-string)
          :unnarrowed t))

  (setq quark/org-capture-musician
        `("m" "Musician to look up"
          entry (file+olp "" "Musicians" "Inbox")
          ,(concat "** %?\n" quark/properties-date-string)
          :unnarrowed t))

  (setq quark/org-capture-general
        `("g" "General"
          entry (file+olp "" "General Inbox")
          ,(concat "** %^{Note} %^g%?\n" quark/properties-date-string)
          :unnarrowed t))

  (setq org-capture-templates
        `(,quark/org-capture-bookmark
          ,quark/org-capture-musician
          ,quark/org-capture-general))
#+end_src

#+RESULTS:
| b | Bookmark | entry | (file+olp  Bookmarks Inbox) | ** %(org-cliplink-capture)%? |

